package ru.maki.weapon.steelarms;

public class BodyArmor extends SteelArms {
    public BodyArmor(int price) {
        super("Бронежилет", "Элемент индивидуальной защиты человека, обеспечивающий защиту верхней части\n" +
                " туловища (торса) человека от воздействия огнестрельного оружия. В целом современный общевойсковой БЖ\n" +
                " — короткая куртка без рукавов, часто с воротником-стойкой. Современные БЖ создаются из материалов, \n" +
                "способных задерживать пули или осколки и поглощать (рассеивать) их энергию: высокопрочных и\n" +
                " высокомодульных защитных тканей (типа кевлар, арамид), металлических (из стали, сплавов титана) либо\n" +
                " керамических композитных бронеэлементов-пластин (из оксида алюминия, карбида бора или карбида кремния),\n" +
                " полиуретана.\n", price);
    }
}
