package ru.maki.weapon.steelarms;

public class Knife extends SteelArms {
    public Knife(int price) {
        super("Нож", "Прежде всего колющий (исходя из этимологии слова), а также рубящий, режущий\n" +
                " инструмент, рабочей частью которого является клинок — полоса твёрдого материала (обычно металла) с\n" +
                " лезвием на одной или нескольких сторонах. В конструкции, чаще всего, можно выделить клинок и рукоять.\n" +
                " У клинка может быть выраженное колющее остриё.\n", price);
    }
}
